[
  {
    "id": "project-1",
    "title": "Network File System (Docs++)",
    "description": "Distributed file system called \"Docs++\" with Google Docs-like functionality, featuring concurrent editing with sentence-level locking, hierarchical folder structure, checkpoint-based version control, access control with request/approval workflow, and comprehensive logging. Architecture includes Name Server (central coordinator), Storage Servers (file storage nodes), and Client components with 12+ file operations.",
    "tech": [
      "C",
      "POSIX",
      "Sockets",
      "Multi-threading"
    ],
    "link": "https://github.com/shrey715/network-file-system",
    "year": "2025",
    "featured": false
  },
  {
    "id": "project-2",
    "title": "shAI",
    "description": "CLI tool that translates natural language queries into safe, executable bash commands using local LLM inference with Ollama (CodeLlama model). Features query validation, command safety checks, detailed execution results, and error reporting—all running locally without external API calls.",
    "tech": [
      "Python",
      "Shell",
      "LLM",
      "Ollama",
      "CodeLlama"
    ],
    "link": "https://github.com/shrey715/shAI",
    "year": "2025",
    "featured": true
  },
  {
    "id": "project-3",
    "title": "AIshA",
    "description": "Unix shell implementation in C with integrated Gemini AI capabilities. Features include natural language command translation, command explanation, AI chat, custom readline implementation using termios (no ncurses), 40+ built-in commands, job control, background process management, and tab completion. Built entirely with POSIX APIs and raw OpenSSL sockets for HTTPS without external dependencies.",
    "tech": [
      "C",
      "POSIX",
      "OpenSSL",
      "Gemini API"
    ],
    "link": "https://github.com/shrey715/aisha",
    "year": "2025",
    "featured": false
  },
  {
    "id": "project-4",
    "title": "Diet Manager",
    "description": "CLI-based diet management system with comprehensive nutritional tracking. Features include food database management (basic and composite foods), daily consumption logs with undo/redo support using Command pattern, multiple calorie calculation methods (Harris-Benedict, Mifflin-St Jeor, WHO), keyword-based food search, and extensible plugin architecture for external food data sources. All data persisted in JSON format.",
    "tech": [
      "C++"
    ],
    "link": "https://github.com/shrey715/diet_manager",
    "year": "2025",
    "featured": false
  },
  {
    "id": "project-5",
    "title": "TradeHub E-Commerce Website",
    "description": "Full-stack e-commerce marketplace for IIIT Hyderabad community built with MERN stack. Features include product buying/selling, user authentication with JWT, image upload via Cloudinary, AI-powered chatbot using Gemini 1.5 Flash, state management with Zustand, responsive UI with Tailwind CSS and Framer Motion animations, and real-time toast notifications.",
    "tech": [
      "JavaScript",
      "React",
      "Node.js",
      "Express",
      "MongoDB",
      "Zustand",
      "Tailwind CSS",
      "JWT",
      "Cloudinary",
      "Gemini API",
      "Axios",
      "Framer Motion"
    ],
    "link": "https://github.com/shrey715/tradehub-ecommerce-website",
    "year": "2025",
    "featured": true
  },
  {
    "id": "project-6",
    "title": "Utility Apps Collection",
    "description": "Next.js-based web application featuring 8+ mini utility tools including QR code generator, SGPA calculator, dictionary (Free Dictionary API), currency converter (Freecurrency API), color picker with palette explorer, weather app (OpenWeather API), real-time markdown editor with syntax highlighting, and PDF merger. Built with TypeScript, Tailwind CSS, and deployed on Vercel with responsive design and dark mode support.",
    "tech": [
      "TypeScript",
      "Next.js",
      "React",
      "Tailwind CSS",
      "Framer Motion",
      "pdf-lib",
      "Axios",
      "React Markdown"
    ],
    "link": "https://github.com/shrey715/utility_apps",
    "year": "2024",
    "featured": false
  },
  {
    "id": "project-7",
    "title": "Y2K Video Editor",
    "description": "Web-based video editor application built with Flask backend and frontend interface. Features video editing capabilities using MoviePy and OpenCV for video processing, Flask-SQLAlchemy for database management, JWT authentication, CORS support for cross-origin requests, and SSL support for secure connections. Developed as a semester project with focus on multimedia processing.",
    "tech": [
      "Python",
      "Flask",
      "OpenCV",
      "HTML",
      "CSS"
    ],
    "link": "https://github.com/shrey715/project-y2k",
    "year": "2024",
    "featured": false
  },
  {
    "id": "project-8",
    "title": "Snake Game",
    "description": "Classic Snake game implementation in C with modular architecture and comprehensive Makefile build system. Includes source files, test suite, and development tools. Created as part of C Programming course at IIIT Hyderabad during Monsoon Semester 2023.",
    "tech": [
      "C"
    ],
    "link": "https://github.com/shrey715/snake_game_cpro23",
    "year": "2023",
    "featured": false
  },
  {
    "id": "project-9",
    "title": "Hotel Management System",
    "description": "Hotel management system with database-driven backend built in Python with MySQL integration. Developed as a mini-project during secondary school at Alpine Public School. Features include hotel operations management with persistent storage using MySQL database.",
    "tech": [
      "Python",
      "MySQL"
    ],
    "link": "https://github.com/shrey715/hms_project",
    "year": "2022",
    "featured": false
  }
]